Repository: LIV4D/MAPLES-DR
Catalog: docs/source/locales/*/LC_MESSAGES/welcome/dataset_description.po
Languages: fr

source: MAPLES-DR Dataset Description
fr: Description du jeu de données MAPLES-DR

source: The project was originally motivated in 2018 by the absence of large fundus public datasets providing pixel-wise annotations of both anatomical and pathological structures of the retina. Such datasets are especially valuable in a context where the deep learning models which achieved state-of-the-art diagnosis of |DR| were criticized for their lack of explainability or interpretability.
fr: Le projet a été initialement motivé, en 2018, par l'absence de grands ensembles de données publics de fonds d'œil fournissant des segmentations au niveau du pixel des structures anatomiques et pathologiques de la rétine. Ces ensembles de données sont pourtant particulièrement précieux dans un contexte où les modèles d'apprentissage profond qui atteignent l'état de l'art du diagnostic automatique de la |DR| sont critiqués pour leur manque d'explicabilité ou d'interprétabilité.

source: We designed |MAPLES-DR| to address this gap by providing pixel-wise annotations of anatomical structures (optic disc, macula, retinal vessels) and pathological lesions (microaneurysms, hemorrhages, neovascularizations, exudates, cotton wool spots, drusens) for nearly 200 images of the well known `MESSIDOR <https://www.adcis.net/en/third-party/messidor/>`_ public dataset. The annotations were performed by a team of seven senior retinologists from hospitals in Toronto and Montréal (Canada).
fr: Nous avons conçu |MAPLES-DR| pour combler cette lacune en fournissant des cartes de segmentation des structures anatomiques (disque et cupule optique, macula, vaisseaux) et pathologiques (micro-anévrismes, hémorragies, néovascularisations, exsudats, nodules cotonneux, drusens) pour près de 200 images du jeu de données public `MESSIDOR <https://www.adcis.net/fr/logiciels-tiers/messidor-fr/>`_. Les annotations ont été réalisées par une équipe de sept rétinologues seniors des hôpitaux de Toronto et Montréal (Canada).

source: |MAPLES-DR| also includes diagnostic for |DR| and |ME| following Canadian teleopthalmology screening guidelines :footcite:`Boucher2020`. These diagnoses are closer to international standards :footcite:`wilkinson2003proposed` :footcite:`zachariah2015grading` than MESSIDOR's original ones.
fr: |MAPLES-DR| inclut également des grades pour la |DR| et |ME| qui suivent les directives canadiennes de dépistage en télémédecine :footcite:`Boucher2020`. Ces directives sont plus proches des standards internationaux :footcite:`wilkinson2003proposed` :footcite:`zachariah2015grading` que les diagnostics fournis par MESSIDOR.

source: Labels Description
fr: Description des annotations

source: Overview of MAPLES-DR labels.
fr: Aperçu des annotations de MAPLES-DR.

source: Segmentation of Anatomical structures
fr: Carte de segmentation des structures rétiniennes

source: Anatomical structures are present in all images, including healthy ones, but their appearance and their proximity to lesions provide valuable diagnostic information.
fr: Les structures anatomiques rétiniennes sont évidemment présentes dans toutes les images, y compris les images saines, mais leur apparence et leur proximité avec les lésions fournissent des informations précieuses pour le diagnostic de la |DR|.

source: **Retinal vessels** are indicative of the stage of |DR|: an increase in arteriolar tortuosity is associated with mild and moderate stages :footcite:`sasongkoRetinalVascularTortuosity2011`, while venous beading and dilation are symptoms of severe proliferative stages. The vascular tree is also used as a reference to assess the readability of an image.
fr: Les **vaisseaux** sont indicatifs du stade de la |DR| : une augmentation de la tortuosité artériolaire est associée aux stades légers et modérés :footcite:`sasongkoRetinalVascularTortuosity2011`, tandis que le rétrécissement et la dilatation veineuse sont des symptômes des stades prolifératifs sévères. L'arbre vasculaire est également utilisé comme référence pour évaluer la lisibilité d'une image.

source: The **optic disc**, **optic cup**, and **macula** are also included in |MAPLES-DR|. Their purpose for diagnosis is two-fold. First, ME is graded by counting the number of lesions within one or two optic disk diameters from the macula, which implies the annotation of both these anatomical structures. Similarly, clinical definitions of |DR| severity often distinguish four quadrants by dividing the retina horizontally by a line through the fovea and optic disc (superior / inferior division) and vertically by a line through the fovea (temporal / nasal division) :footcite:`purvesRetinotopicRepresentationVisual2001`. Second, the positions of the lesions in relation to these healthy structures may indicate different etiologies and severities. For example, clinical guidelines sometimes distinguish between disc neovascularization and other neovascularization.
fr: Le **disque optique**, la **cupule optique** et la **macula** sont également inclus dans |MAPLES-DR|. Leur objectif pour le diagnostic est double. Premièrement, le |ME| est classée en comptant le nombre de lésions dans un ou deux diamètres de disque optique de la macula, ce qui implique l'annotation de ces deux structures anatomiques. De même, les définitions cliniques de la gravité de la |DR| distinguent souvent quatre quadrants en divisant la rétine horizontalement par une ligne passant par la fovéa et le disque optique (division supérieure / inférieure) et verticalement par une ligne passant par la fovéa (division temporale / nasale) :footcite:`purvesRetinotopicRepresentationVisual2001`. Deuxièmement, les positions des lésions par rapport à ces structures saines peuvent indiquer différentes étiologies et gravités. Par exemple, les directives cliniques distinguent parfois la néovascularisation du disque et les autres néovascularisations.

source: One sample of the train set is centered on the optic disc instead of the macula which is not visible in this image. No segmentation of the macula is therefore provided for this image.
fr: Un échantillon du jeu d'entraînement est centré sur le disque optique plutôt que sur la macula qui n'est pas visible sur cette image. Aucune segmentation de la macula n'est donc fournie pour cette image.

source: Similarly, four samples of the train set and two samples of the test set are missing a segmentation of the optic cup because their boundaries were judged too ambiguous by the retinologists.
fr: De même, quatre échantillons de l'ensemble d'entraînement et deux échantillons de l'ensemble de test ne disposent pas d'une segmentation de la cupule optique car leurs frontières ont été jugées trop ambiguës par les rétinologues.

source: Trying to access these segmentation maps will return an blank mask and raise a warning. To remove these images from your dataset, you can specify :func:`maples_dr.configure(exclude_missing_macula=True) <maples_dr.configure>` or :func:`maples_dr.configure(exclude_missing_cup=True) <maples_dr.configure>` to exclude them.
fr: Accéder à ces cartes de segmentation renverra un masque vide et affichera un avertissement. Pour exclure ces images du jeu de données utilisez : func:`maples_dr.configure(exclude_missing_macula=True) <maples_dr.configure>` ou :func:`maples_dr.configure(exclude_missing_cup=True) <maples_dr.configure>`.

source: Segmentation of Red lesions
fr: Segmentation des lésions rouges

source: Diabete mellitelus affects the walls of the vessels, eventually causing microvascular dysfunctions that manifest in the retina as microaneurysms, hemorrhages, intraretinal microvascular abnormalities (:abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)`), or neovessels. We refer to these pathological structures as "red lesions".
fr: Le diabète affecte les parois des vaisseaux, causant des dysfonctionnements micro-vasculaires qui se manifestent dans la rétine sous forme de micro-anévrismes, d'hémorragies, d'anomalies micro-vasculaires rétiniennes (:abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)`), ou de néovaisseaux. Ces structures pathologiques sont appelées "lésions rouges".

source: **Microaneurysms** appear as small circular dilations of the capillaries. They are early signs of microvascular dysfunction and are commonly used to detect mild |DR|.
fr: Les **micro-anévrismes** apparaissent comme de petites dilatations circulaires des capillaires. Ils sont un symptôme précoce de dysfonctionnement micro-vasculaire et sont couramment utilisés pour détecter une |DR| légère.

source: Intraretinal **hemorrhages** develop in more advanced stages of the pathology and are divided into dot or blot hemorrhages. Dot hemorrhages appear as circular and well-defined spots and are typically caused by the rupture of a microaneurysm. Distinguishing them from microaneurysms is challenging, and only fundus angiography (FA) can differentiate the two with complete certainty. Blot hemorrhages are larger and have less defined borders. Both were annotated simply as *hemorrhages* in |MAPLES-DR|. Clinical practice also recognizes superficial (flame-shaped) and vitreous hemorrhages that appear in the most severe stages of retinopathy, none was discovered in the MAPLES-DR dataset.
fr: Les **hémorragies rétiniennes** se développent dans les stades plus avancés de la pathologie et sont divisées en hémorragies ponctuées (dot hemorrhages) ou en taches (blot hemorrhages). Les hémorragies ponctuées apparaissent comme des points circulaires et bien définies et sont généralement causées par la rupture d'un micro-anévrisme. Les distinguer des micro-anévrismes est difficile, et seule l'angiographie rétinienne (FA) peut les différencier avec certitude. Les hémorragies en taches sont plus grandes et ont des bords moins définis. Dans |MAPLES-DR|, les deux ont été annotées comme des *hémorragies*. Des hémorragies superficielles (en forme de flamme) et des hémorragies vitreuses peuvent aussi apparaître dans les stades les plus sévères de la rétinopathie, aucune n'a été découverte dans l'ensemble de données MAPLES-DR.

source: Starting from the moderate non-proliferative stage (R2), irregular intraretinal vessels can appear, referred to as :abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)`. The next stage of the disease (R3) coincides with even more extensive intraretinal changes, which are precursors to worsening of the disease. Indeed, the presence of :abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)` indicates a 50% risk of developing **neovascularisation** within one year, corresponding to a transition to the proliferative stage of the disease. Leakages from extensive neovascularisation are responsible for preretinal and vitreous hemorrhages that can cause major visual loss. In the fundus image, neovascularisations are difficult to distinguish from :abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)`; however, fluorescein angiography may reveal a leakage that serves as a discriminant factor between the two. In the absence of this imaging modality, :abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)` are not differentiated from neovascularisation in |MAPLES-DR|.
fr: À partir du stade modéré non prolifératif (R2), des vaisseaux rétiniens intra-rétiniens irréguliers peuvent apparaître, appelés :abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)`. Le stade suivant de la maladie (R3) coïncide avec des changements intra-rétiniens encore plus importants, qui sont des prédicteurs de l'aggravation de la maladie. En effet, la présence de :abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)` indique un risque de 50% de développer une **néovascularisation** dans l'année qui suit, ce qui correspond à une transition vers le stade prolifératif de la maladie. Les fuites des néovascularisations importantes sont responsables d'hémorragies pré-rétiniennes et vitreuses qui peuvent causer une perte visuelle majeure. Sur l'image du fond d'œil, les néovascularisations sont difficiles à distinguer des :abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)` ; cependant, l'angiographie à la fluorescéine peut révéler une fuite qui sert de facteur discriminant entre les deux. En l'absence de cette modalité d'imagerie, les :abbr:`IRMA (Intra-Retinal Microvascular Abnormalities)` ne sont pas différenciées des néovascularisations dans |MAPLES-DR|.

source: Segmentation of Bright Lesions
fr: Segmentation des lésions claires

source: In the severe stages of |DR|, the retina thickens (edema formation) and hard **exudates** (also known as lipoprotein exudation) may appear, potentially causing loss of visual acuity. These deposits usually arise from leakage from damaged capillaries. Furthermore, in the case of ischemia, one can observe a blockage in axonal transport (the movement of mitochondria, lipids, proteins, and other substances within the neuron's body, allowing for its renewal) in the optic nerve fiber layer.
fr: Dans les stades sévères de la |DR|, la rétine s'épaissit (formation d'œdème) et des **exsudats** durs peuvent apparaître, causant potentiellement une perte d'acuité visuelle. Ces dépôts proviennent généralement de fuites des capillaires endommagés. De plus, en cas d'ischémie, on peut observer un blocage du transport axonal (le mouvement des mitochondries, des lipides, des protéines et d'autres substances à l'intérieur du corps de l'axone, permettant son renouvellement) dans la couche des fibres du nerf optique.

source: This can lead to the appearance of lesions known as **Cotton Wool Spots** (:abbr:`CWS (Cotton Wool Spots)`), resulting from axoplasmic accumulations. They are characterized by their white appearance and blurry borders. While the principal etiology is diabetic retinopathy, :abbr:`CWS (Cotton Wool Spots)` can be observed in other vascular diseases (systemic arterial hypertension, vein obstruction, coagulopathies...)
fr: Cela peut conduire à l'apparition de lésions connues sous le nom de **nodules cotonneux** (:abbr:`CWS (Cotton Wool Spots)`) résultant d'accumulations axoplasmiques. Ils sont caractérisés par leur apparence blanche et leurs bords flous. Alors que leur étiologie principale est la rétinopathie diabétique, les :abbr:`CWS (Cotton Wool Spots)` peuvent également être observés dans d'autres maladies vasculaires (hypertension artérielle systémique, obstruction veineuse, coagulopathies...)

source: Finally, |MAPLES-DR| also provides annotations of **drusens**. These lesions are more commonly associated with Age-related Macular Degeneration (:abbr:`AMD (Age-related Macular Degeneration)`), with a prevalence varying from 10\% (fifth decade of life) to 35\% (seventh decade). They usually appear around the macula and are histologically situated at the interface with the Retinal Pigment Epithelium (RPE). It is supposed that they originate from degenerative products of the RPE's cells and are composed of lipids and glycoproteins. Classifying early stage :abbr:`AMD (Age-related Macular Degeneration)` depends on estimating the size of the drusen.
fr: Enfin, |MAPLES-DR| fournit également des annotations des **drusens**. Ces lésions sont plus couramment associées à la dégénérescence maculaire liée à l'âge (:abbr:`AMD (Age-related Macular Degeneration)`), avec une prévalence variant de 10\% (cinquième décennie de vie) à 35\% (septième décennie). Ils apparaissent généralement autour de la macula et sont histologiquement situés à l'interface avec l'épithélium pigmentaire rétinien (RPE). Il est supposé qu'ils proviennent de produits dégénératifs des cellules du RPE et sont composés de lipides et de glycoprotéines. La classification des stades précoces de :abbr:`AMD (Age-related Macular Degeneration)` s'appuie sur l'estimation de la taille des drusens.

source: |DR| and |ME| grades
fr: Grades de |DR| et de |ME|

source: |MAPLES-DR| grades for |DR| and |ME| annotated by the retinologists follow the guidelines developed for Canadian teleopthalmology screening. These guidelines distinguish six grades for |DR|:
fr: Les grades de |DR| et de |ME| de |MAPLES-DR| suivent les directives développées pour le dépistage de la |DR| par télémédecine au Canada. Ces directives distinguent six grades pour la |DR|:

source: **R0**: absent
fr: **R0**: absente

source: **R1**: mild
fr: **R1**: légère

source: **R2**: moderate
fr: **R2**: modérée

source: **R3**: severe
fr: **R3**: sévère

source: **R4A**: proliferative
fr: **R4A**: proliférative

source: **R4S**: stable treated proliferative
fr: **R4S**: proliférative traitée et stable

source: **R6**: insufficient quality for grading
fr: **R6**: qualité insuffisante pour un diagnostic fiable

source: and three for ME:
fr: et trois pour la |ME| :

source: **M0**: absent
fr: **M0**: absente

source: **M1**: mild
fr: **M1**: légère

source: **M2**: moderate
fr: **M2**: modérée

source: **M6**: insufficient quality for grading
fr: **M6**: qualité insuffisante pour un diagnostic fiable

source: Grades are defined systematically by the number and position of visible red and bright retinal lesions. Each grade is associated with a recommended course of action (from rescreening in two years for mild cases, to immediate referral to an ophthalmologist for the more severe ones).
fr: Les grades sont définis par le nombre et la position des lésions rétiniennes rouges et claires visibles. Chaque grade est associé à un plan d'action recommandé (depuis une nouvelle visite dans deux ans pour les cas légers, à une prise en charge immédiate par un ophtalmologiste pour les cas les plus sévères).

source: A detailed definition of the grading system can be found in `this paper <http://doi.org/10.1016/j.jcjo.2020.01.001>`_ :footcite:`Boucher2020`.
fr: Une définition détaillée du système de gradation est accessible dans `cet article <http://doi.org/10.1016/j.jcjo.2020.01.001>`_ :footcite:`Boucher2020`.

source: Data Records
fr: Structure des données

source: |MAPLES-DR| dataset is distributed as two archives: |MAPLES-DR.zip|_ and |AdditionalData.zip|_. The first one contains the main data of MAPLES-DR (segmentation maps and grades), while the second one contains additional information on the annotation processes (time to complete, comments) as well as intermediate data (pre-annotation maps, grades before consensus...).
fr: Le jeu de données |MAPLES-DR| est distribué sous la forme de deux archives : |MAPLES-DR.zip|_ et |AdditionalData.zip|_. La première contient les données finales de MAPLES-DR (cartes de segmentation et grades). La seconde contient des informations complémentaires collectées lors du processus d'annotation (temps, commentaires) ainsi que les données intermédiaires (cartes de pré-annotation, grades avant consensus...).

source: |MAPLES-DR.zip|_ is the main archive of the dataset. It's split into two folders `train/` and `test/`, each one containing a table `diagnosis.csv` with the final |DR| and |ME| grades as well as 12 folders: one for each biomarker. Those folders store the segmentation maps as png binary images following the same naming convention as their MESSIDOR counterparts (eg. `20051019_38557_0100_PP.png`). The train set is composed of 138 images, while the test set contains 60 images.
fr: |MAPLES-DR.zip|_ est l'archive principale du jeu de données. Elle est divisée en deux dossiers `train/` et `test/`, chacun contenant un fichier `diagnosis.csv` avec les grades finaux de |DR| et de |ME| ainsi que 12 sous-dossiers : un pour chaque biomarqueur. Ces dossiers stockent les cartes de segmentation sous forme d'images binaires png nommées suivant la nomenclature de MESSIDOR (e.g. `20051019_38557_0100_PP.png`). L'ensemble d'entraînement est composé de 138 images, tandis que l'ensemble de test en contient 60.

source: Overview of the main |MAPLES-DR| archive: |MAPLES-DR.zip|_.
fr: Aperçu de l'archive principale de |MAPLES-DR| : |MAPLES-DR.zip|_.

source: The image ``20051020_55346_0100_PP`` is centered on the optic disc and its macula is not visible. To raise awareness of this issue, **the segmentation maps of its macula has been removed** from ``MAPLES-DR.zip/train/Macula/`` which therefore only contains 137 images.
fr: L'image ``20051020_55346_0100_PP`` est centrée sur le disque optique et sa macula n'est pas visible. Pour éviter toute confusion, **la carte de segmentation de sa macula a été retirée** de ``MAPLES-DR.zip/train/Macula/`` qui ne contient donc que 137 images.

source: Furthemore, for six images (4 in the train set and 2 in the test set), the boundaries of the optic cup were judged too ambiguous by the retinologists for a proper annotation. **No segmentation map of optic cup are provided for those images** diminishing the number of images in ``MAPLES-DR.zip/train/OpticCup/`` and ``MAPLES-DR.zip/test/OpticCup/`` to respectively 134 and 58 images.
fr: De plus, pour six images (4 dans l'ensemble d'entraînement et 2 dans l'ensemble de test), les frontières de la cupule optique ont été jugées trop ambiguës par les rétinologues pour une annotation correcte. **Aucune carte de segmentation de la cupule optique n'est donc fournie pour ces images** réduisant le nombre d'images dans ``MAPLES-DR.zip/train/OpticCup/`` et ``MAPLES-DR.zip/test/OpticCup/`` à respectivement 134 et 58 images.

source: The segmentation maps in |MAPLES-DR.zip|_ were resized to match the resolution of the original MESSIDOR images, which vary in dimensions (ranging from 960x1440 up to 1536x2304 pixels). If your application requires a homogeneous resolution (e.g. for training a deep learning model), we advice to use :doc:`maples_dr <python_library>` python library to crop and resize the images and the segmentation maps to a unique resolution.
fr: Les cartes de segmentation de |MAPLES-DR.zip|_ ont été redimensionnées pour correspondre à la résolution des images originales de MESSIDOR, qui varient en dimensions (allant de 960x1440 à 1536x2304 pixels). Pour les applications nécessitant une résolution homogène (par exemple l'entraînement de réseau de neurones), nous vous conseillons d'utiliser le paquet python :doc:`maples_dr <python_library>` pour recadrer et redimensionner les images et les cartes de segmentation à une résolution commune.

source: The second archive contains all the additional information and data collected during the annotation process. It's also the only archive downloaded and used by the :doc:`maples_dr <python_library>` library. Indeed because |AdditionalData.zip|_ includes all the annotations and pre-annotation in the resolution at which they were annotated (1500x1500 pixels), as well as the individual diagnoses graded by each retinologist, all the data contained in the |MAPLES-DR.zip|_ can be derived from it.
fr: La seconde archive contient toutes les informations et données additionnelles collectées lors du processus d'annotation. C'est également la seule archive téléchargée et utilisée par la bibliothèque :doc:`maples_dr <python_library>`. En effet, parce que |AdditionalData.zip|_ inclut toutes les annotations et pré-annotations dans la résolution à laquelle elles ont été annotées (1500x1500 pixels), ainsi que les diagnostics individuels notés par chaque rétinologue, toutes les données propre à l'archive |MAPLES-DR.zip|_ peuvent en être dérivées.
