Repository: LIV4D/MAPLES-DR
Catalog: docs/source/locales/*/LC_MESSAGES/welcome/dataset_description.po
Languages: fr

source: **Note on the duplicates**: initially 200 images were annotated but we latter realized that two of them were duplicates from the original MESSIDOR dataset (same images stored using different names). The 2 duplicates were removed from |MAPLES-DR.zip|_ but were kept in |AdditionalData.zip|_ for transparency.
fr: **Note sur les doublons** : initialement, |MAPLES-DR| comptait des annotations pour 200 images. Mais à la fin de la campagne d'annotation, nous avons pris connaissance que deux de ces images faisaient parties des doublons de l'ensemble de données original MESSIDOR (des images dupliquées, stockées sous deux noms différents). Ces 2 doublons ont été retirés de |MAPLES-DR.zip|_, mais ont été conservés dans |AdditionalData.zip|_ à des fins de transparence.

source: Overview of the additional archive: |AdditionalData.zip|_.
fr: Aperçu de l'archive complémentaire : |AdditionalData.zip|_.

source: |AdditionalData.zip|_ contains the following files:
fr: L'archive |AdditionalData.zip|_ contient les fichiers suivants :

source: **biomarkers_annotations_infos.xls**: identify which ``Retinologist`` performed the annotation of a given biomarker category, the ``Time`` spent on each annotation (in seconds), any ``Comment`` they left, and the ``Annotation#`` rank (1 for the first image annotated, 200 for the last).
fr: **biomarkers_annotations_infos.xls**: identifie quel rétinologue (``Retinologist``) a réalisé l'annotation d'une catégorie de biomarqueur donnée, le temps (``Time``) passé sur chaque annotation (en secondes), les commentaires (``Comment``) laissés, et le rang de l'annotation (``Annotation#``: 1 pour la première image annotée, 200 pour la dernière).

source: **diagnosis_infos.xls**: contains the grades of |DR| and |ME| annotated by each Retinologist as well as the consensus they reached. It also includes the comments left by the retinologists while grading.
fr: **diagnosis_infos.xls**: contient les grades de |DR| et de |ME| annotés par chaque rétinologue ainsi que le grade consensuel atteint après délibération. Il inclut également les commentaires laissés par les rétinologues lors du diagnostic.

source: **MESSIDOR-ROIs.csv**: provides the bounding boxes extracted from the MESSIDOR images to obtain squared regions of interest without blank borders. The bounding boxes are stored as top-left (``x0``, ``y0``) and bottom-right (``x1``, ``y1``) coordinates in pixels. This file also includes the original resolution in pixel of the MESSIDOR images: ``H`` and ``W`` (resp. height and width).
fr: **MESSIDOR-ROIs.csv**: fournit les regions d'intérêt extraites des images de MESSIDOR pour obtenir des régions carrées et sans bordures. Les coordonnées des régions d'intérêt sont définies par les coordonnées de leur coin supérieur gauche (``x0``, ``y0``) et inférieur droit (``x1``, ``y1``) en pixels. Ce fichier inclut également la résolution originale en pixels des images de MESSIDOR : ``H`` et ``W`` (resp. la hauteur et la largeur).

source: **dataset_record.yaml**: a yaml file containing the ``biomarkers`` name, the ``test`` and ``train`` split (as a list of image name), and the names of the ``duplicates`` associated to the names of their "siblings" in |MAPLES-DR| train set.
fr: **dataset_record.yaml**: un fichier yaml contenant le nom des biomarqueurs (``biomarkers``), la définition des ensembles d’entraînement et de test (``train`` et ``test``) sous forme de listes de noms d'images, et le nom des ``doublons`` associés au nom de leur "jumeau" dans l'ensemble d’entraînement de |MAPLES-DR|.

source: **annotations/**: this folder has 12 subfolders (one for each biomarker), which in turn contains all 200 segmentation maps annotated by the retinologists (train, test and duplicates). One segmentation map was removed from the ``Macula`` folder, and 6 were removed from ``OpticCup`` (see warning above). All segmentation maps are stored as png binary masks in the resolution at which they were annotated (1500x1500 pixels) using the ROIs provided in the ``MESSIDOR-ROIs.csv``.
fr: **annotations/**: ce dossier contient 12 sous-dossiers (un pour chaque biomarqueur), qui contiennent à leur tour les 200 cartes de segmentation annotées par les rétinologues (entraînement, test et doublons confondues). Une carte de segmentation a été retirée du dossier ``Macula`` et 6 ont été retirées du dossier ``OpticCup`` (voir avertissement ci-dessus). Toutes les cartes de segmentation sont stockées sous forme de masques binaires png dans la résolution à laquelle elles furent annotées (1500x1500 pixels) et en utilisant les régions d’intérêt décrites dans le fichier ``MESSIDOR-ROIs.csv``.

source: **pre_annotations/**: this folder contains the automatic segmentation of Vessels, Exudates, Hemorrhages, and Microaneurysms provided as pre-annotations to the retinologists.
fr: **pre_annotations/**: ce dossier contient les segmentations automatiques des vaisseaux, des exsudats, des hémorragies et des micro-anévrismes fournies comme pré-annotations aux rétinologues.

source: Annotation Procedure
fr: Procédure d'annotation

source: The annotation procedure was co-designed with the team of retinologists to meet a triple objective:
fr: La procédure d'annotation a été co-conçue avec l'équipe de rétinologues pour répondre à un triple objectif :

source: Providing an intuitive yet effective annotation tool for the classification and segmentation of biomarkers in fundus images.
fr: Fournir un outil d'annotation intuitif mais efficace pour la classification et la segmentation des biomarqueurs dans les images de fond d'œil.

source: Enabling a collaborative effort on common annotations despite the geographical distance between the retinologists and the limited time each could dedicate to this program.
fr: Permettre un effort collaboratif sur des annotations communes malgré la distance géographique entre les rétinologues et le temps limité que chacun pouvait consacrer à ce programme.

source: Designing a "scalable" annotation protocol, capable of being extended to much more ambitious annotation campaigns, such as labeling large Canadian telemedicine databases containing tens of thousands of images.
fr: Concevoir un protocole d'annotation "scalable", capable d'être étendu à des campagnes d'annotation beaucoup plus ambitieuses, telles que l'étiquetage de grandes bases de données canadiennes de télémédecine contenant des dizaines de milliers d'images.

source: To meet these challenges, we developed a custom web-based annotation platform allowing the following workflow: expert annotators can access the Web portal at any time to consult and edit annotations with specialized drawing tools; these annotations and the related information (annotation times, comments) are centralized and stored in a secure database hosted on our laboratory server; as the research team, we assign tasks to annotators, monitor progress, and export annotations via a Python API. The annotation platform (portal, annotation tools, server backend, and Python API) as well as training material for annotators is available on `GitHub <https://github.com/LIV4D/AnnotationPlatform>`_.
fr: Pour relever ces défis, nous avons développé une plateforme d'annotation web personnalisée permettant le fonctionnement suivant : les annotateurs experts peuvent accéder au portail Web à tout moment pour consulter et modifier les annotations avec des outils de dessin spécialisés ; ces annotations et les informations associées (temps d'annotation, commentaires) sont centralisées et stockées dans une base de données sécurisée hébergée sur notre serveur de laboratoire ; en tant qu'équipe de recherche, nous attribuons des tâches aux annotateurs, surveillons les progrès et exportons les annotations via une API Python. La plateforme d'annotation (portail, outils d'annotation, serveur backend et API Python) ainsi que le matériel de formation pour les annotateurs sont disponibles sur `GitHub <https://github.com/LIV4D/AnnotationPlatform>`_.

source: For more details on the annotation process please refer to the `MAPLES-DR paper <https://arxiv.org/abs/2402.04258>`_ :footcite:`maples_dr`.
fr: Pour plus de détails sur le processus d'annotation, veuillez vous référer à l'article `MAPLES-DR <https://arxiv.org/abs/2402.04258>`_ :footcite:`maples_dr`.

source: References
fr: Bibliographie
