Repository: LIV4D/MAPLES-DR
Catalog: docs/source/locales/*/LC_MESSAGES/welcome/messidor.po
Languages: fr

source: Using MESSIDOR fundus images
fr: Utiliser les images de MESSIDOR

source: The fundus images used to create MAPLES-DR are the property of the MESSIDOR consortium and are therefore not included in the dataset. However, they are freely available to any research team who requires them on the `Consortium's website <https://www.adcis.net/en/third-party/messidor/>`_. This page will guide you through the steps to include the MESSIDOR fundus images along with MAPLES-DR labels.
fr: Les images de fond d'oeil annotées dans |MAPLES-DR| sont la propriété du consortium MESSIDOR et ne sont donc pas inclues dans le jeu de données. Cependant elles sont accessible librement à toute équipe de recherche qui les demande sur le `site du consortium <https://www.adcis.net/en/third-party/messidor/>`_. Cette page fournit les instructions pour inclure les images de MESSIDOR avec les annotations de MAPLES-DR.

source: Download MESSIDOR fundus images
fr: Télécharger les images de fond d'oeil de MESSIDOR

source: The MESSIDOR fundus images can be downloaded from the `Consortium's website <https://www.adcis.net/en/third-party/messidor/>`_. The Consortium requires you to fill a form with your personal information, agree to the terms of the license agreement, and verify your email address before downloading the images.
fr: Les images de MESSIDOR peuvent-être téléchargées depuis le `site du consortium <https://www.adcis.net/en/third-party/messidor/>`_. Vous devrez remplir un formulaire avec vos informations personelles, accepter les termes de licence, et vérifier votre adresse email avant pour accéder à la page de téléchargement.

source: The download page contains links to several files. The fundus images are divided into 12 zip archives named ``Base__ images (zip)``. Make sure to download all 12 archives (`Base11.zip`, `Base12.zip`, ..., `Base34.zip`) to the same directory.
fr: La page de téléchargement contient des liens vers de plusieurs fichiers. Les images de fond d'oeil ont été divisées en 12 archives zip appelées ``Base__ images (zip)``. Assurez-vous de télécharger les 12 archvies (`Base11.zip`, `Base12.zip`, ..., `Base34.zip`) dans un dossier unique.

source: Configure MESSIDOR local path
fr: Configurer le chemin vers MESSIDOR

source: Once you have downloaded the images, you can include them in the dataset by calling:
fr: Une fois les images téléchargées, vous pouvez les inclure dans le dataset avec:

source: Upon calling :func:`maples_dr.load_train_set` or :func:`maples_dr.load_test_set`, the 200 fundus images related to MAPLES-DR will be extracted, cropped and resized to match MAPLES-DR resolution. They will be accessible under the field ``"fundus"`` similarly to the MAPLES-DR biomarkers.
fr: Lors de l'appel de :func:`maples_dr.load_train_set` ou de :func:`maples_dr.load_test_set`, les 200 images de fond d'oeil annotées dans MAPLES-DR seront extraites, découpées et redimenssionées pour correspondre à la résolution des cartes de segmentation de MAPLES-DR. Ces images de fond d'oeil seront accessibles de la même manière que les autres biomarqueurs de |MAPLES-DR|, sous le nom ``"fundus"``.

source: Similarly, if you export the dataset to local files with :func:`maples_dr.export_train_set` or :func:`maples_dr.export_test_set`, a folder named ``fundus`` will be created in the same directory as the other biomarkers, containing the fundus images at the appropriate resolution.
fr: De façon analogue, lors d'un export de |MAPLES-DR| vers des dossiers locaux avec :func:`maples_dr.export_train_set` ou :func:`maples_dr.export_test_set`, un dossier appelé ``fundus`` sera créé à coté de ceux des autres biomarqueurs, contenant les images de fond d'oeil à la résolution adéquate.

source: Acknowledgements
fr: Remerciements

source: The MESSIDOR dataset was kindly provided by the Messidor program partners (see `https://www.adcis.net/en/third-party/messidor/ <https://www.adcis.net/en/third-party/messidor/>`_).
fr: Le jeu de données d'images de fond d'œil est fourni par les partenaires du programme Messidor (voir `https://www.adcis.net/fr/logiciels-tiers/messidor-fr/ <https://www.adcis.net/fr/logiciels-tiers/messidor-fr/>`_).

source: We remind that users of the MESSIDOR database (and therefore MAPLES-DR users) are encouraged to reference the following article::
fr: Nous rappelons que les utilisateurs de la base de données MESSIDOR (et donc les utilisateurs de |MAPLES-DR|) sont encouragés à citer l'article suivant::
