Repository: LIV4D/MAPLES-DR
Catalog: docs/source/locales/*/LC_MESSAGES/welcome/quickstart.po
Languages: fr

source: Quick Start
fr: Démarrage Rapide

source: The MAPLES-DR dataset is available for download on `Figshare <https://doi.org/10.6084/m9.figshare.24328660>`_. But in the context of training machine learning algorithms we strongly recommend users to install the `maples_dr` python package to easily download, format and manipulate the dataset.
fr: Le jeu de données |MAPLES-DR| est disponible en téléchargement sur `Figshare <https://doi.org/10.6084/m9.figshare.24328660>`_. Cependant, pour les applications de l'entraînement d'algorithmes d'apprentissage automatique, nous recommandons fortement d'utiliser directement le paquet python `maples_dr` pour télécharger, formater et manipuler facilement ce jeu de données.

source: This page will guide you through the installation process and basic usage of the package: loading the dataset in memory or saving it in a local folder.
fr: Cette page vous guidera à travers le processus d'installation et les cas d'utilisation courants du paquet: charger le jeu de données en mémoire ou le sauvegarder localement.

source: The `maples-dr` package is available on PyPI and can be installed using pip:
fr: Le paquet `maples-dr` est disponible sur PyPI et peut être installé avec:

source: Simple Usage
fr: Utilisation Simple

source: Once imported, MAPLES-DR train or test sets can be loaded in memory with a single line of Python code.
fr: Une fois importé, les ensembles d'entraînement ou de test de |MAPLES-DR| peuvent être chargés en mémoire avec une seule ligne de code Python.

source: If necessary, the dataset archive is automatically downloaded from `Figshare <https://doi.org/10.6084/m9.figshare.24328660>`_, extracted and cached locally. The data is then returned as a :class:`maples_dr.Dataset` which takes the form of a list of dictionaries containing all MAPLES-DR labels. (For more information, see the :doc:`../api_reference/dataset` class documentation).
fr: Si nécessaire, l'archive du jeu de données est automatiquement téléchargée depuis `Figshare <https://doi.org/10.6084/m9.figshare.24328660>`_, extraite et mise en cache localement. Les données sont ensuite retournées sous forme d'un :class:`maples_dr.Dataset` (assimilable à une liste de dictionnaires contenant toutes les étiquettes de |MAPLES-DR|, voir :doc:`../api_reference/dataset` pour plus de détails).

source: For example, the vessel map of the first sample of the train set can be accessed with:
fr: Par exemple, la carte des vaisseaux de la première image de l'ensemble d'entraînement peut être accédée avec:

source: Alternatively, if you'd rather rely on your own code for data loading, MAPLES-DR images can be saved in local folders:
fr: Sinon, si vous préférez utiliser votre propre code pour le chargement des données, les images de |MAPLES-DR| peuvent être sauvegardées dans des dossiers locaux:

source: As a result of these commands, all the labels of MAPLES-DR are saved as image files in their appropriate folders: ::
fr: Suite à ces commandes, toutes les cartes de segmentations de |MAPLES-DR| seront sauvegardées sous forme d'image png, chaque structure rétinienne ayant son dossier dédié: ::

source: Configure the datasets behavior
fr: Configurer le comportement de la bibliothèque python

source: The dataset behavior can be tailored to ease the integration with your code or specific application. For instance, you might need the images and biomarker maps to have a specific resolution, a specific format (PIL image or numpy array), a specific channel order (`rgb` or `bgr`)... The default behavior of the library is configured with the :func:`maples_dr.configure` method, and the configuration options are detailed in :class:`maples_dr.config.DatasetConfig` documentation.
fr: Le comportement de `maples_dr` peut être ajusté pour faciliter son intégration avec votre code. Par exemple, vous pourriez avoir besoin que les images et les cartes de biomarqueurs aient une résolution spécifique, un format spécifique (image PIL ou tableau numpy), un ordre spécifique des canaux de couleurs (`rgb` ou `bgr`)... Le comportement par défaut de la bibliothèque est configuré avec la méthode :func:`maples_dr.configure`, et les options de configuration sont documentées en détail dans la documentation de :class:`maples_dr.config.DatasetConfig`.

source: The following example shows how to configure the dataset to return images as numpy arrays (instead of PIL images) and with a resolution of 512x512 pixels:
fr: L'exemple suivant montre comment configurer le jeu de données pour retourner les images sous forme de tableaux numpy (au lieu d'images PIL) et avec une résolution de 512x512 pixels:

source: The same method can be used to specify a local path where the library should read MAPLES-DR data, instead of downloading them from Figshare.
fr: La même méthode peut être utilisée pour spécifier un chemin local où seront lues les données de |MAPLES-DR|, au lieu de les télécharger depuis Figshare.

source: Finally, a local path to the MESSIDOR dataset can also be specified with this function in order to include the fundus images from MESSIDOR along with the MAPLES-DR labels. (See :doc:`../welcome/messidor` for more details.)
fr: Enfin, un chemin local vers le jeu de données MESSIDOR peut également être spécifié avec cette fonction pour inclure les images de fond d'oeil de MESSIDOR. (Voir :doc:`../welcome/messidor` pour plus de détails.)

source: For more information on all the methods presented in this quick start, please refer to :doc:`../api_reference/quick_api` documentation.
fr: Pour plus d'informations sur toutes les méthodes présentées dans ce guide de démarrage, veuillez vous référer à la documentation de :doc:`../api_reference/quick_api`.
