Repository: LIV4D/MAPLES-DR
Catalog: docs/source/locales/*/LC_MESSAGES/index.po
Languages: fr

source: MAPLES-DR Dataset
fr: Le jeu de données MAPLES-DR

source: Dataset Description
fr: Description du jeu de données

source: Python library
fr: API python

source: Examples
fr: Exemples

source: API Reference
fr: Définition de l'API

source: MAPLES-DR Dataset Documentation
fr: Documentation du jeu de données MAPLES-DR

source: **MAPLES-DR** *(MESSIDOR Anatomical and Pathological Labels for Explainable Screening of Diabetic Retinopathy)* is a public dataset which provides expert-level diagnosis of |DR| and pixel-wise segmentation maps of 10 retinal structures.
fr: **MAPLES-DR** *(MESSIDOR Anatomical and Pathological Labels for Explainable Screening of Diabetic Retinopathy)* est un jeu de données public de diagnostics de |DR| et de cartes de segmentations de structures rétiniennes.

source: For **198 fundus image** of the public dataset :doc:`MESSIDOR <welcome/messidor>` :footcite:`MESSIDOR`, our team of seven Canadian senior retinologists graded :abbr:`DR (Diabetic Retinopathy)` and :abbr:`ME (Macular Edema)`, and segmented ten retinal structures related to those pathologies: **optic disc** and **cup**, **macula**, **vessels**, **micro-aneurysms**, **hemorrhages**, **neo-vessels**, **exudates**, **cotton wool spots** and **drusens**. A detailed description of those biomarkers and their role in the diagnosis of DR can be found in the :doc:`dataset description section <welcome/dataset_description>` of this documentation. By releasing this dataset, we hope to help the AI community improves the explainability and reliability of machine learning models for DR screening.
fr: Notre équipe canadienne de sept rétinologues séniors ont annoté des grades de |DR| (Rétinopathie Diabétique) et de |ME| (Œdème Maculaire), sur **198 images de fond d'œil** du jeu de données public :doc:`MESSIDOR <welcome/messidor>` :footcite:`MESSIDOR`. Pour chacune de ces images, ils ont aussi segmentés dix structures rétiniennes symptomatiques de ces deux pathologies: le **disque** anévrismes**, les **hémorragies**, les **néo-vaisseaux**, les **exsudats**, les **nodules cotonneux** and les **drusens**. Pour une description détaillée de tous ces biomarqueurs ainsi que leurs rôles dans le dépistage de la |DR|, référez-vous à la section :doc:`description du jeu de données <welcome/dataset_description>` de cette documentation. En publiant |MAPLES-DR| nous espérons contribuer aux recherches visant à améliorer l'interprétabilité des modèles de diagnostique automatique de la DR par apprentissage machine.

source: Overview of |MAPLES-DR| content and annotation process. (Credit: :footcite:t:`maples_dr`)
fr: Vue d'ensemble du contenu et du protocole d'annotation de |MAPLES-DR|. (Crédit: :footcite:t:`maples_dr`)

source: The annotation procedure relied on AI generated pre-segmentation of some retinal structures and a custom web-based annotation platform. The complete annotation process is documented in `this paper <https://doi.org/10.1038/s41597-024-03739-6>`_ :footcite:`maples_dr`.
fr: La procédure d'annotation de |MAPLES-DR| s'est appuyée sur des cartes pré-segmentées par :abbr:`IA (Intelligence Artificielle)` pour certaines structures rétiniennes, ainsi que sur un outils d'annotation hébergé sur le web. Le protocole d'annotation est documenté en détail dans `ce papier <https://doi.org/10.1038/s41597-024-03739-6>`_ :footcite:`maples_dr` *(l'URL pointe vers un preprint ArXiv, le temps que notre manuscrit suive son processus de révision)*.

source: Usage
fr: Utilisation

source: The dataset is freely available for download from the `MAPLES-DR Figshare repository <https://doi.org/10.6084/m9.figshare.24328660>`_.
fr: Le jeu de données est accessible librement depuis le `dépôt Figshare de MAPLES-DR <https://doi.org/10.6084/m9.figshare.24328660>`_.

source: However, for machine learning usage we encourage researchers to directly download MAPLES-DR labels through :doc:`the python library <welcome/python_library>`: ``maples_dr``. This library provides a simple API to load MAPLES-DR labels, and eases their integration with the original fundus images of MESSIDOR, by automating the process of matching, cropping and resizing them to a uniform format.
fr: Cependant, nous recommandons plutôt de télécharger les annotations de |MAPLES-DR| à l'aide du :doc:`le paquet python<welcome/python_library>`: ``maples_dr``. Nous avons développé cette bibliothèque Python pour simplifier l'utilisation conjointe des cartes de segmentation de MAPLES-DR avec les images de fond d'œil originales fournies par MESSIDOR. L'API de ``maples_dr`` automatise ainsi l'appariement des images, leur découpage et redimensionnement vers une résolution uniforme. Ainsi formaté, les données sont particulièrement adaptées pour entraîner des réseaux de neurones à segmenter les structures rétiniennes.

source: Note that the fundus images are the property of the MESSIDOR program partners and are not included in the MAPLES-DR dataset, but they are available to any research teams who requires them on `Messidor website <https://www.adcis.net/en/third-party/messidor/>`_. Follow the instructions in :doc:`MESSIDOR section <welcome/messidor>` to integrate them with |MAPLES-DR| labels.
fr: Les images de fond d'œil associées aux annotations de |MAPLES-DR| sont la propriété du consortium MESSIDOR et ne sont donc pas incluses dans les fichiers de |MAPLES-DR|. Cependant, elles sont disponibles à toutes les équipes de recherche qui en font la demande sur le `site de Messidor <https://www.adcis.net/fr/logiciels-tiers/messidor-fr/>`_. La :doc:`section MESSIDOR <welcome/messidor>` de la présente documentation décrit les étapes à suivre pour les intégrer aux annotations de |MAPLES-DR| à l'aide du paquet `maples_dr`.

source: If you wish to use this dataset in an academic work, we kindly ask you to cite the following `paper <https://doi.org/10.1038/s41597-024-03739-6>`_ :footcite:`maples_dr`::
fr: Nous demandons aux chercheurs qui souhaitent utiliser ce jeu de données dans leur travaux académique de citer `le papier <https://doi.org/10.1038/s41597-024-03739-6>`_ lié à la publication de |MAPLES-DR|:footcite:`maples_dr`::

source: Additional Resources
fr: Ressources Additionnelles

source: Segmentation Models
fr: Modèles de segmentation

source: We released the segmentation models developed and trained on MAPLES-DR as two Python libraries: they bundle the weights and PyTorch code required to automatically segment retinal vessels and lesions. These libraries were designed to be used by researchers or clinicians without deep learning expertise. They are available on GitHub:
fr: Nous avons rendu public des modèles de segmentation développés et entraînés sur |MAPLES-DR| sous la forme de deux bibliothèques Python. Ces bibliothèques contiennent les poids et le code PyTorch nécessaires pour segmenter automatiquement les vaisseaux de la rétine et certaines de ses lésions Elles furent conçus pour être utilisées par des chercheurs ou des cliniciens sans expérience de la manipulation de réseaux de neurones. On peut les trouver sur GitHub:

source: `fundus-vessels-toolkit <https://github.com/gabriel-lepetitaimon/fundus-vessels-toolkit>`_ for automatic segmentation and graph extraction of the retinal vasculature;
fr: `fundus-vessels-toolkit <https://github.com/gabriel-lepetitaimon/fundus-vessels-toolkit>`_ pour la segmentation et l'extraction automatique de la vasculature rétinienne;

source: `fundus-lesions-toolkit <https://github.com/ClementPla/fundus-lesions-toolkit>`_ for automatic semantic segmentation of microaneurysms, hemorrhages, exudates and |CWS|.
fr: `fundus-lesions-toolkit <https://github.com/ClementPla/fundus-lesions-toolkit>`_ pour la segmentation sémantique et automatique des micro-anévrismes, des hémorragies, des exsudats et des |CWS| (nodules cotonneux).

source: Annotation Platform
fr: Plateforme d'Annotation

source: The web-based annotation platform used to annotate MAPLES-DR is also available on `GitHub <https://github.com/LIV4D/AnnotationPlatform>`_.
fr: La plateforme d'annotation utilisées pour annoter |MAPLES-DR| est accessible sur `GitHub <https://github.com/LIV4D/AnnotationPlatform>`_.

source: Reference
fr: Bibliographie

source: Acknowledgements
fr: Remerciements

source: The LIV4D laboratory would like to thank Dr. Marie Carole Boucher, Dr. Michael H Brent, Dr. Renaud Duval as well as Dr. Karim Hammamji, Dr. Ananda Kalevar, Dr. Cynthia Qian, and Dr. David Wong for their time and effort labeling the MAPLES-DR dataset. We also thank Dr. Fares Antaky and Dr. Daniel Milad for participating in a inter-observer variability study that helped us assess the quality of lesions segmentations of MAPLES-DR.
fr: Le laboratoire LIV4D tient à remercier Dr. Marie Carole Boucher, Dr. Michael H Brent, Dr. Renaud Duval ainsi que Dr. Karim Hammamji, Dr. Ananda Kalevar, Dr. Cynthia Qian, et Dr. David Wong pour leur temps et implication lors de l'annotation du jeu de données |MAPLES-DR|. Nous remercions également Dr. Fares Antaky et Dr. Daniel Milad pour leur participation à une étude de variabilité inter-observateurs qui a permis d'évaluer la qualité des segmentations de lésions de |MAPLES-DR|.

source: This study was funded by the Natural Science and Engineering Research Council of Canada as well as Diabetes Action Canada and FROUM (Fonds de recherche en ophtalmologie de l'Université de Montréal).
fr: Ce travail a été financé par le :abbr:`CRSNC (Conseil de Recherches en Sciences Naturelles et en génie du Canada)` ainsi que Diabètes Action Canada et le :abbr:`FROUM (Fonds de recherche en ophtalmologie de l'Université de Montréal)`.

source: The original MESSIDOR dataset was kindly provided by the Messidor program partners (see `https://www.adcis.net/en/third-party/messidor/ <https://www.adcis.net/en/third-party/messidor/>`_).
fr: Le jeu de données d'images de fond d'œil est fourni par les partenaires du programme Messidor (voir `https://www.adcis.net/fr/logiciels-tiers/messidor-fr/ <https://www.adcis.net/fr/logiciels-tiers/messidor-fr/>`_).
